{
  "hero_caption": "",
  "notes": "today was very fun with night motor bike food tour and was very busy with no time to rest and a whole day out\n",
  "afternoon_photos": [
    {
      "image": "/uploads/20251228_101308-1-.jpg"
    },
    {
      "image": "/uploads/20251228_132355.jpg"
    },
    {
      "image": "/uploads/20251228_133510.jpg"
    },
    {
      "image": "/uploads/20251228_153707.jpg"
    },
    {
      "image": "/uploads/20251228_153724.jpg"
    },
    {
      "image": "/uploads/20251228_153726.jpg"
    }
  ],
  "morning": "This morning in Ho Chi Minh City we woke up at 7:00 a.m. after a sleepover — four of us squeezed into one bed. At around 7:45 we went to the buffet provided by new world Saigon hotel it was amazing there was so many options from pancakes to pastries to pho and to mini banh mi, definitely recommended. The food was absolutely delicious there was pancakes, banh mi, pho, eggs, bacon, dumplings etc. We left after 5-7 tasty plates and 2 whole hours of heaven filled in our stomachs . We left full at 9:30.You can can come from 6-1This morning in Ho Chi Minh City we woke up at 7:00 a.m. after a sleepover — four of us squeezed into one bed! ",
  "costs": "",
  "evening": "After finishing our cute plushies we went on a 15 seat bus with a tour guide and driver from the Saigon food tour company .Our first stop was the post office it was very big unlike the ones in Australia it had a small post office stand in the building, a stamps collecting place and may more souvenir stall and was crowded with lots of people .Our 2nd and last stop was a museum about the Vietnamese war. The museum presented the war from multiple perspectives, including the Vietnamese, the Americans, and the Viet Cong. though it was a bit interesting our tour guide to join us in the museum it was harder to learn .I wouldn't recommend as it was 4 hours and a bit boring, but the next activity was great and chaotic fun .We went on a motorcycle food tour. At first i thought I'm going to die I'm not doing this at all but then the engine suddenly revved, and my motor driver was on the road, my body tensed up and i clinged for dear life but then I slowly got used to it and felt safe and we arrive at our first stop, our entree , with many more meals to go",
  "city": "HCMC",
  "day_number": 2,
  "date": "28 Dec 2025",
  "kids_rating": "4 stars, everything was amazing but the bus tour was a bit boring",
  "gallery": [
    {
      "image": "/uploads/20251228_132355.jpg"
    },
    {
      "image": "/uploads/20251228_133510.jpg"
    },
    {
      "image": "/uploads/20251228_153707.jpg"
    },
    {
      "image": "/uploads/20251228_153724.jpg"
    },
    {
      "image": "/uploads/20251228_153726.jpg"
    },
    {
      "image": "/uploads/20251228_182139.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0020-2.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0024.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0028.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0025.jpg"
    }
  ],
  "hero_image": "/uploads/gemini_generated_image_gx67bdgx67bdgx67.png",
  "evening_photos": [
    {
      "image": "/uploads/img-20251228-wa0020.jpg"
    },
    {
      "image": "/uploads/20251228_182139.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0020-2.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0024.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0028.jpg"
    },
    {
      "image": "/uploads/IMG-20251228-WA0025.jpg"
    }
  ],
  "title": "City Tour & Motorbike Food Tour",
  "morning_photos": [],
  "afternoon": "Today we made plushies, it was in a small shop called Hoi Hoi Project. First, we started off by picking the template for the shape of the plushie, Caitlyn and I (Yeshara) picked a bunny shape, and Shannara picked a bear shape. After we chose a template, we started sewing—it was a very long process and took about 45 minutes. Then we flipped it inside out, and we started stuffing the plushie from a small gap we had left when sewing. Finally, we began putting the accessories on. They had many charms to choose from, and we were only allowed 10. When we were done, we put the plushie in a box, gave it a cool birth certificate, and got some mini perfume for our teddy."
}
