{
  "hero_caption": "Hội An Night Market ✨",
  "notes": "",
  "afternoon_photos": [],
  "morning": "In the morning we woke up at 7 am and got ready to go to the breakfast buffet. We quickly got a few plates filled with all their delicious food then we went back upstairs to pack our bags and everything else, so we would be very organised and not forget anything. Finally when we were done we headed downstairs to the reception to check out then got a few taxis to drop us off at the airport which took one hour to get there.",
  "costs": "",
  "evening": "After settling in at our fancy hotel, we went out to explore the famous Hội An night market! The whole riverside was lit up with beautiful lanterns and there were boats floating on the water with colorful lights. We walked around the market stalls and found a leather shop where we got custom made leather shoes and wallets for our brothers - all handmade! The atmosphere was magical with all the lantern lights reflecting on the water.",
  "city": "HCMC → Hội An",
  "day_number": 4,
  "date": "30 Dec 2025",
  "kids_rating": "Today was a bit boring because we didn't do much during the day 2 stars ⭐️⭐️ but the night market was amazing!",
  "gallery": [
    { "image": "/uploads/20251230_183811.jpg" },
    { "image": "/uploads/20251230_183847.jpg" },
    { "image": "/uploads/20251230_183914.jpg" },
    { "image": "/uploads/20251230_191128.jpg" },
    { "image": "/uploads/20251230_201039.jpg" },
    { "image": "/uploads/20251230_204945.jpg" }
  ],
  "hero_image": "/uploads/20251230_201039.jpg",
  "evening_photos": [
    { "image": "/uploads/20251230_183847.jpg" },
    { "image": "/uploads/20251230_183914.jpg" },
    { "image": "/uploads/20251230_204945.jpg" }
  ],
  "title": "Night Market & Leather Shopping",
  "morning_photos": [],
  "afternoon": "When we finally arrived into the airport after one hour, we went to the check-in which was a very short line. It took about 15 minutes to get to the end of the line then after a line of security we finally got to the gate where we did some water colour painting for half an hour then we went to the airplane. It was very boring so I slept during the whole flight, Caitlyn was two rows behind us."
}
