{
  "hero_caption": " Finally In Vietnam ",
  "notes": "",
  "afternoon_photos": [
    {
      "image": "/uploads/20251227_112049-1-.jpg"
    }
  ],
  "morning": "Yeshara and Shenara had to go on 2 planes from Australia to Thailand and Thailand to Vietnam.\nfor the whole the morning we on planes sleeping. When we finally landed in Ho Chi Minh City we were originally going to use an app called grab that gives us easy access to a driver that will take us to the places we need to be but, a small business stand in the airport offered to take us to our hotel (New World Saigon Hotel HCMC) $25 AUD in 30 minutes .Its actually wasn't far but since there was so much traffic as usual with all the many motorbikes  it took 30 minutes. \n",
  "costs": "",
  "evening": "later that night we went to a fancy restaurant which was very busy but luckily, we managed to get a spot quickly we all had some ramen and my mum dared to eat the most disgusting looking snail. I (yeshara) had a iced lychee caitlyn had an iced strawbery and so did shenara in the end we all loved all the food.It was all very yummy",
  "city": "HCMC",
  "day_number": 1,
  "date": "27 Dec 2025",
  "kids_rating": "the day was and very fun and i was definitely not jet lagged",
  "gallery": [
    {
      "image": "/uploads/20251227_193917.jpg"
    },
    {
      "image": "/uploads/img-20251228-wa0020.jpg"
    },
    {
      "image": "/uploads/20251227_194059.jpg"
    }
  ],
  "hero_image": "/uploads/gemini_generated_image_ops0qxops0qxops0.png",
  "evening_photos": [
    {
      "image": "/uploads/20251227_123813.jpg"
    }
  ],
  "title": "Arrival Day",
  "morning_photos": [],
  "afternoon": "Finally, we arrived but our hotel check in time was in long time, so we handed over our heavy luggage to the staff putting it in a trolley while our light bags like my backpack stayed with me. Since there was a nice cafe in the lounge we went over and got some flavorful mocktails and some pictures. Some pastries caught our eye, and we bought a chocolate caramel pastry. We still had quite a bit of time, so we took a 5-minute walk to a spa and nail salon called Prive Nails, there we got gel names, and we were treated with some popcorn and a soft drink. We sat in in the back in royal like manicure chairs, while we got spoiled with gel nails and the popcorn and drink. finally, after a long time Caitlyn showed up"
}