{
  "hero_caption": "",
  "notes": "",
  "afternoon_photos": [],
  "morning": "In the morning we had the same breakfast buffet at 9 and while we were eating my mum (Shenara and Yeshara’s) rented a bike from the hotel  and cycled to the beach which was very close like less than 100metres away.after breakfast Yeshara and I (Shenara)  went to the beach with our mum to just roam around. The beach didn’t have anyone but as we walk across the beach we saw more and more people but we didn’t see anyone further than 2 metres of the water.after those 2 metres the water got very dark.which means that even though it is nice and shallow for a bit it drops off sharply in to deep water making it dangerous to go too far.thankfully we stayed on the sand and the shallow water .",
  "costs": "",
  "evening": "in the night cailtyn came over to sleep in our room and since we where all tired we didnt want to eat much so we just went to eat at the buffet for a little bit of stuff we mainly got all the desserts though like red velvet cake or jelly or stuff of the sort",
  "city": "Hội An",
  "day_number": 6,
  "date": "1 Jan 2026",
  "kids_rating": "",
  "gallery": [],
  "hero_image": "",
  "evening_photos": [],
  "title": "New Year’s Day",
  "morning_photos": [],
  "afternoon": "Today in hoi an we went on a coconut boat ride we went there on a shuttle bus and it was really fun. It was an 16 seater and me and the twins sat in the back. It took about 30 minutes to get there but finally after a long trip we arrived ,the mums didn’t have the best fate in it since they get sea sick, but the kids were excited We all had to sit separately since we are little and adults are a bit bigger than us so we had to sit one kid two adults we saw various plants. It was so fascinating once we arrived to the destination we heard lots of songs. Vietnam is crazy about music one of our favorite things in the coconut ride was that we got to sit on the merry go of coconut it was really fun. We had to go over around and around in a coconut and it was super fast, but it got us really dizzy and me [Caitlyn] and Shenara screaming our heads off although yeshara and my sister Claudia were calm and not yelling at all when we arrived back we did some crab fishing. It was really cool cause I got to hold your crab. "
}